<!DOCTYPE html>
<html lang="en">
<head>
    <link rel="stylesheet" href="Styles/guias.css">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Guias</title>
</head>
<title>Registrarse a tolol+</title>
    <a class="boton-personalizado1" href="C:/Users/Matias/Desktop/mati/Index.html">Regresar a la pagina principal</a>
<img src="./images/banner-lolsito.jpeg" width="1520" alt="">
<br> 


<body class="guia">
<div class="guia1">
    <li >Micro y Macro</li>
<li >Jugabilidad</li>
<li>Runas</li>
<li>Equipos</li>
</div>





  <div class="text">
    <p><strong> m&aacute;ximo exponente durante el &uacute;ltimo lustro de los eSports naci&oacute; el 27 de octubre de 2009 y lleg&oacute; el d&iacute;a 16 de enero de 2018 a su octava temporada. El LoL, o &laquo;League of Legends&raquo;, es el juego franquicia de la compa&ntilde;&iacute;a Riot Games, fundada por Brandon &laquo;Ryze&raquo; Beck y Marc &laquo;Tryndamere&raquo; Merrill.</p>
<p>Mucho ha cambiado el juego desde la primera temporada en el apartado t&eacute;cnico basado en un mod de &laquo;Warcraft III: The Frozen Throne, Defense of the Ancients&raquo;, aunque su estilo y concepto de juego se mantienen intactos.</p>
<p>Y ahora que os hemos contado cual es el origen del &laquo;League of Legends&raquo;, adem&aacute;s de datar su fecha de nacimiento y de decir quienes son sus creadores, es el momento de hablar de lo que importa: las cosas que necesitas saber antes de ponerte manos a la obra, o lo que es lo mismo, antes de que dediques miles de horas a jugar.</p>
<p>Una jugabilidad accesible
    
<br/>El LoL posee una curva de aprendizaje explosiva de inicio, que ayuda a los jugadores m&aacute;s inexpertos y dificulta la progresi&oacute;n de los m&aacute;s experimentados debido a dos conceptos clave: micro y macro.</p>
</strong>
<img src="./images3/League-Of-Legends-1-1024x576.jpg" alt="Victoria">
<hr>

<p><strong>Micro, que es la riqueza de aprendizaje de juego con el personaje, cada uno de ellos con una habilidad pasiva, 4 habilidades b&aacute;sicas (de obligada lectura y comprensi&oacute;n para sacarles el m&aacute;ximo partido) y dos hechizos de invocador. Todo esto sumado a las caracter&iacute;sticas animaciones de velocidad de autoataque (en ocasiones cancelaci&oacute;n del mismo tambi&eacute;n) y forma de moverse (animaci&oacute;n de caminar, cancelaci&oacute;n de la misma, fintas y tama&ntilde;o del mismo) a las que el jugador deber&aacute; de acostumbrarse para masterizar cada uno de ellos.Y macro, que es la suma de decisiones estrat&eacute;gicas en busca de las sinergias y combinaciones de personajes junto a su itemizaci&oacute;n, gesti&oacute;n del oro, visi&oacute;n del mapa y movilidad de los mismos para conseguir objetivos estructurales: Torres, Inhibidores, Nexo o Monstruos: Dragones ( Agua, Viento, Tierra y Fuego con sus diferentes caracter&iacute;sticas al conseguirlos), Heraldo y Bar&oacute;n Nashor. Los objetivos estructurales y monstruos ayudan en gran medida a destruir el nexo enemigo. Explicaremos un poco sus caracter&iacute;sticas m&aacute;s adelante.Un juego en constante cambio</strong><br /><strong>La constante implementaci&oacute;n de parches en el LoL (actualmente un parche cada 2 semanas) requiere la obligatoria adaptaci&oacute;n por parte del jugador, ya que en un s&oacute;lo parche pueden haber desde cambios &iacute;nfimos (arreglo de bugs y balanceo b&aacute;sico de personajes o items) a cambios dr&aacute;sticos (nuevos personajes, cambios de itemizaci&oacute;n, cambios en los personajes, comportamiento de los minions, torres u objetivos).</strong></p>
<img src="./images3/League-Of-Legends-6-1024x576.jpg" alt="">
</body>
<hr>
<p><strong>Los jugadores m&aacute;s expertos est&aacute;n acostumbrados a formas de jugar en constante cambio, fundamentalmente por el entorno competitivo y la presencia de multitud de streamers o youtubers que experimentan con diferentes builds (itemizaci&oacute;n de personajes) y composiciones de equipo, siendo &eacute;stos un ejemplo imitable para la comunidad y generando modas.</strong></p>
<p><strong>Recomendamos el seguimiento de los entornos competitivos de los diferentes pa&iacute;ses para poder sacarle el m&aacute;ximo partido y comprender el META. En los &uacute;ltimos a&ntilde;os, se ha visto reducida la variedad de cambios en lo que creemos que es un intento de premiar la habilidad de los jugadores por encima de las posibles sorpresas de composiciones o builds off-meta (formas de jugar o crear personajes menos populares que en ocasiones funcionan bien en entornos competitivos, dando lugar a nuevas modas que que potencialmente pueden llegar a convertirse en META) y facilitando as&iacute; la profesionalizaci&oacute;n de jugadores en entornos de equipo.</strong></p>
<p><strong>Un elenco de personajes enorme</strong><br /><strong>La gran y creciente profundidad del elenco de personajes del LoL (de diferentes razas, roles y clases) sumado a las constantes revisiones resulta abrumador: Reworks, o cambios dr&aacute;sticos tanto visuales como de habilidades de un campe&oacute;n; Buffs: mejoras en el da&ntilde;o, rango, duraci&oacute;n o enfriamiento de las habilidades; y Nerfs: empeoramiento de las mismas, hace que sea dif&iacute;cil agotar las posibilidades jugables de este MOBA.</strong></p>
<img src="./images3/League-Of-Legends-7.jpg" alt="">
<hr>
<p><strong>El objetivo de las revisiones que reciben los campeones es para adaptarse, balancearse o actualizarse. Hoy en d&iacute;a en el parche 8.2 donde nos encontramos, el juego cuenta con 139 campeones, un abismal salto, mortal y pirueta desde la versi&oacute;n alpha del juego, que contaba con &uacute;nicamente 17 personajes: Alistar, Annie, Ashe, Fiddlesticks, Jax, Kayle, Maestro Yi, Morgana, Nunu, Ryze, Sion, Sivir, Soraka, Teemo, Tristana, Twisted Fate y Warwick.</strong></p>
<p><strong>Principios b&aacute;sicos del mapa y del juego</strong><br /><strong>League of Legends est&aacute; estructurado en 3 l&iacute;neas, con 2 torres a derribar por carril y un nexo defendido por 3 torres exteriores (una por l&iacute;nea) que defienden en exclusiva 3 inhibidores (que al ser destru&iacute;dos favorecen la creaci&oacute;n de s&uacute;bditos m&aacute;s fuertes (super minions, mucho m&aacute;s grandes y fuertes, empujando o en el argot, pusheando las l&iacute;neas mucho m&aacute;s r&aacute;pido hacia el nexo enemigo) por parte del equipo que lo destruye y 2 torretas (m&aacute;s da&ntilde;inas que el resto) y que defienden exclusivamente el nexo de ser destru&iacute;do, lo que significar&iacute;a el final de la partida.</strong></p>
<hr>
<img src="./images3/League-Of-Legends-8.jpg" alt="">
<p><strong>Este concepto no ha cambiado desde la creaci&oacute;n del juego y sigue siendo el m&aacute;s importante a la hora de ganar la partida. El movimiento de los compa&ntilde;eros y las diferentes estructuras pueden ser seguidos constantemente a trav&eacute;s el mapa, y el de los enemigos queda limitado por la niebla de guerra (fog of war), para la que necesitaremos invertir nuestro oro en guardianes de visi&oacute;n y as&iacute; posibilitarnos observar los movimientos del enemigo.</strong></p>
<p><strong>El constante visionado del mapa para asistir a nuestros compa&ntilde;eros y/o anular a los enemigos es de vital importancia en el desarrollo de las partidas.</strong></p>
<p><strong>Roles de los personajes en el LoL</strong><br /><strong>Los roles han venido predeterminados por el META fundamentalmente desde su creaci&oacute;n: TOP (Carril superior), JUNGLA (haci&eacute;ndose cargo de los mounstros objetivo que la ocupan), MEDIO (carril intermedio) y BOT (carril inferior, normalmente ocupado por 2 personajes).</strong></p>
<p><strong>Como hemos comentado anteriormente, debido a las constantes actualizaciones de contenido y lo grande que es la comunidad de &ldquo;invocadores&rdquo; o &ldquo;summoners&rdquo; (jugadores), existen tutoriales e informaci&oacute;n en m&uacute;ltiples plataformas (youtube, mobafire,mobalitics, op.gg, reddit y los respectivos subreddit como summonerschool o los subreddit espec&iacute;ficos de cada personaje del juego) presentando gu&iacute;as tanto para principiantes como expertos para actualizarse con facilidad a la carta sobre cada parche y la famosa estructuraci&oacute;n por niveles (tier list) del impacto potencial de cada personaje en la partida en funci&oacute;n de cada parche: God Tier- Nivel Dios (S), Strong -Fuerte (A), Good-Bueno (B), Average-Medio (C), Below Average- Bajo la media (D), Weak- D&eacute;bil (E).</strong></p>
<p><strong>Recomendamos encarecidamente la lectura de cada parche y sus respectivas gu&iacute;as sobre todo lo que acontece en el juego para sacarle el m&aacute;ximo partido a nuestra experiencia.</strong></p>
<p></p>
<p><strong>Runas</strong><br /><strong>La mayor novedad de la temporada 8 del LoL en lo que a jugabilidad se refiere son las runas, es decir, lo que a&ntilde;adimos a nuestro personaje en el transcurso de la selecci&oacute;n de campeones previa a la partida para adaptarlos a cada partida y determinar la forma en que los jugamos. Contamos con 5 &aacute;rboles de runas primarios que pueden combinarse con un &aacute;rbol secundario. Sin entrar en profundidad en las posibilidades y variantes, los &aacute;rboles de runas son los siguientes:</strong></p>
<p><strong>Brujer&iacute;a: Habilidades potenciadas y manipulaci&oacute;n de recursos</strong><br /><strong>Valor: Durabilidad y control de masas</strong><br /><strong>Inspiraci&oacute;n: Herramientas creativas y manipulaci&oacute;n de las reglas</strong><br /><strong>Dominaci&oacute;n: Da&ntilde;o explosivo y acceso a objetivos</strong><br /><strong>Precisi&oacute;n: Ataques mejorados y da&ntilde;o sostenido</strong></p>

<img src="./images3/League-Of-Legends-9.jpg" alt="">
<hr>
<p><strong> y subclases
    <br />Los personajes del LoL y su variedad hace que se encuadren en distintos tipos seg&uacute;n sus caracter&iacute;sticas sin contar con los items que podemos comprar para aprovechar sus caracter&iacute;sticas innatas:</p>
<p>Tanques: El nombre habla por s&iacute; mismo. Son capaces de recibir una gran cantidad de da&ntilde;o y suelen disponer de habilidades para frenar, congelar, interrumpir o desplazar entre otras a enemigos y aliados. Hay dos tipos de tanques. Estos son Vanguardia, que suponen la referencia de ataque normalmente y suelen ser determinantes en las batallas de equipo, centrando la atenci&oacute;n del enemigo; y Guardianes o Protectores, que son referencias defensivas que est&aacute;n llamadas a defender a aquellos campeones en nuestro equipo que hagan da&ntilde;o y sean m&aacute;s fr&aacute;giles frente a las amenazas del enemigo<br />Luchadores: Son campeones mel&eacute; capaces de infligir una gran cantidad de da&ntilde;o y recibirlo a partes iguales. Hay dos tipos de luchadores. Estos son Colosos, de movilidad limitada, sus objetivos suelen ser la destrucci&oacute;n de torres enemigas, crear presi&oacute;n de mapa (situaci&oacute;n donde se necesitan 2 campeones enemigos para acabar con ellos) e interrumpir o desorganizar las peleas numerosas; y Embestidores, dotados de gran movilidad suelen buscar uno o dos objetivos prioritarios en el enemigo que permitan al equipo inclinar la balanza en las peleas de grupo. Adem&aacute;s son grandes aunque no los mejores duelistas en el uno contra uno.<br /><br /></p>
</strong>
<p><strong>Ejecutores: Campeones que destacan por su movilidad y da&ntilde;o. Hay dos tipos de luchadores. Estos son Asesinos, su gran movilidad les permite entrar y salir de las peleas, contando con habilidades que amplifican el da&ntilde;o radicalmente para hacer desaparecer los campeones enemigos objetivo y otras que les ayudan a salir indemnes durante la tarea ya que est&aacute;n obligados a exponerse y suelen ser fr&aacute;giles; y Escaramuzadores, estos son los mejores duelistas del juego. Sus habilidades innatas les permiten hacerse cargo de objetivos espec&iacute;ficos y son capaces de recibir una cantidad sustancial de da&ntilde;o ya que no son tan fr&aacute;giles como los asesinos.</strong><br /><strong>Magos: Su movilidad reducida en general hace que sea f&aacute;cil centrar su atenci&oacute;n en ellos, pero sus habilidades en &aacute;rea, control de oleadas de s&uacute;bditos y su elevado potencial de da&ntilde;o les convierte en una gran amenaza. Hay dos tipos de luchadores. Estos son Magos de Batalla, aquellos cuyo rango de habilidades es de corta-media distancia y necesitan introducirse en las l&iacute;neas enemigas para ser relevantes. No poseen normalmente grandes habilidades disruptoras o de control de masas, pero su da&ntilde;o en &aacute;rea no puede ser ignorado por el enemigo; y Magos de Artiller&iacute;a, caracterizados por ser capaces de infligir una gran cantidad de da&ntilde;o sin exponerse, estos magos poseen mayoritariamente habilidades de larga distancia que obligan a los asesinos y tanques de vanguardia a centrar su atenci&oacute;n en ellos para evitar que hagan da&ntilde;o de forma libre.</strong><br /><br /></p>
<p><strong>Tiradores: Los tiradores representan el mayor da&ntilde;o por segundo del equipo normalmente, siendo realizado a distancia y dependiendo en gran medida de su posicionamiento debido a su gran fragilidad y sensibilidad frente a las habilidades disruptoras y a los asesinos. Los campeones aliados necesitan prestarles atenci&oacute;n para poder desarrollar su m&aacute;ximo potencial y que su da&ntilde;o por segundo no desaparezca f&aacute;cilmente durante las peleas</strong><br /><strong>Elementos en el mapa</strong><br /><strong>Dentro del mapa, adem&aacute;s, debemos tener en cuenta los siguientes elementos:</strong></p>
<p><strong>S&uacute;bditos (minions): Los s&uacute;bditos salen desde nuestro nexo en oleadas y son la fuente de oro m&aacute;s accesible para todos los campeones y l&iacute;neas de la partida. Cada 30 segundos, viene una nueva oleada y tienen estas caracter&iacute;sticas: Dos oleadas de 6 minions, 3 melee y 3 de rango (casters), seguidas de una oleada de 7 minions, 3 melee, 3 de rango y un s&uacute;bdito de asedio (cannon minion) que hace m&aacute;s da&ntilde;o y con m&aacute;s capacidad defensiva. El comportamiento de la oleada es caracter&iacute;stico y cada vez que nos peleemos con el enemigo, nuestros s&uacute;bditos le atacar&aacute;n, siempre que sean autoataques o habilidades &ldquo;point-click&rdquo; (o que afectan directa y &uacute;nicamente al campe&oacute;n enemigo). El control de las oleadas de minions de forma eficaz es complejo y requiere pr&aacute;ctica para conseguir sacarles el m&aacute;ximo partido. La red est&aacute; plagada de tutoriales al respecto y siempre recomendamos visionar los conceptos m&aacute;s actualizados ya que como hemos comentado anteriormente est&aacute;n en constante cambio debido a la frecuencia de los parches.</strong></p>
<p><br /><br /></p>
<img src="./images3/League-Of-Legends-10.jpg" alt="">
<hr>
<p><strong>Torres: Estas fortificaciones como hemos mencionado previamente, detienen las oleada de minions y a los campeones en su camino al nexo enemigo. Cada torre tiene ciertas caracter&iacute;sticas como un rango de ataque a su alrededor, que dan visi&oacute;n de todo lo que ocurre (incluyendo a las unidades y trampas invisibles) en ese rango. La torre atacar&aacute; al campe&oacute;n enemigo siempre que este nos haga da&ntilde;o en alg&uacute;n momento mientras est&aacute; en rango de ataque, es decir, podemos tratar de destruir la misma sin tocar al enemigo sin que esta nos ataque. Dos torres por l&iacute;nea protegen el camino hacia el nexo, una torre por l&iacute;nea protege un inhibidor y dos torres especiales protegen el nexo de ser atacado. No es necesario destruir todas las torres para llegar al nexo enemigo. Destruir una torre de inhibidor y un inhibidor, ya permite atacar a las 2 torres que protegen el nexo y su respectivo nexo. Si no hemos destru&iacute;do la torre previa, la siguiente torre permanece invulnerable y no podremos tocarlas aunque ellas s&iacute; nos atacar&aacute;n. Todas las torres dan oro al ser destruidas pero el equipo que derriba la primera recibe una bonificaci&oacute;n sustancial de la cantidad del mismo.</strong><br /><strong>Imagen de una torre en mitad del mapa</strong><br /><strong>Imagen de una torre en mitad del mapa</strong></p>
<p><strong>Monstruos: En la jungla tenemos 15 campamentos, de los cuales 8 son de mounstros normales con sus caracter&iacute;sticas, 4 nos brindan la posibilidad de adquirir mejoras temporales al matarlos (2 monstruos azules y 2 rojos) y otros 3 nos permiten adquirir mejoras tambi&eacute;n circunstanciales o permanentes:</strong></p>
<p></p>
<p><br /><br /></p>
<img src="./images3/League-Of-Legends-11.jpg" alt="">
 <hr>
<p><strong>Modos de juego</strong><br /><strong>Los modos de juego en el LoL quedan divididos en 4, siendo dos de ellos en los que se puede competir (rankear) una vez hemos conseguido llegar al nivel 30 en nuestra cuenta y teniendo un m&iacute;nimo de 20 personajes que podemos ir adquiriendo permanentemente mediante esencias azules (las iremos sumando al acabar cada partida en funci&oacute;n de lo bien que el sistema de juego valora nuestro rendimiento en partida poni&eacute;ndonos una nota, desde D-, 20 esencias azules, hasta S+, 60 esencias azules y d&aacute;ndonos algunos bonus como cajas o llaves que nos permitir&aacute;n obtener, iconos, personajes o disfraces para los mismos).</strong></p>
<p><strong>Los modos de juego son estos:</strong></p>
<p><strong>Grieta del invocador: Mapa de 5 contra 5</strong><br /><strong>El bosque retorcido: Mapa de 3 contra 3</strong><br /><strong>El abismo de los lamentos: Mapa de 5 contra 5 en una sola l&iacute;nea y con personajes aleatorios</strong><br /><strong>Eventos aleatorios en rotaci&oacute;n: Los eventos tienen una duraci&oacute;n limitada y aportan variedad al sistema de juego</strong><br /><strong>Y en cuanto al sistema competitivo, &eacute;ste est&aacute; clasificado en ligas y divisiones. De menor a mayor tenemos:</strong></p>
<p><strong>&ndash; Bronce, Plata, Oro, Platino y Diamante (contando &eacute;stas con 5 divisiones cada una), Maestro y Challenger (con una divisi&oacute;n cada una).</strong></p>
<img src="./images3/League-Of-Legends-12.jpg" alt="">
<hr>
<p><strong>Adem&aacute;s de los modos de juego contamos con la posibilidad de jugar contra la inteligencia artificial del sistema (bots) en niveles principiante e intermedio tanto en la Grieta del Invocador como en el Bosque Retorcido y tambi&eacute;n podemos entrenar,siguiendo un tutorial, entrenamiento de batalla y una herramienta de pr&aacute;ctica donde podemos lanzarnos a probar diferentes items, situaciones de juego, etc. presentando una gran riqueza de opciones que ser&aacute;n el deleite de aquellos que busquen mejorar la habilidad de sus manos con cada personaje fuera del PVP.</strong></p>
<p><strong>Buena suerte novatos</strong><br /><strong>Hasta aqu&iacute; nuestra gu&iacute;a para principiantes de League of Legends (LoL)</strong></p>
</div>
</html>